/*━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

   🛠️ 𝘿𝘼𝙑𝙄𝘿 𝙏𝙀𝘾𝙃 𝙄𝙉𝘾 - 𝙊𝙁𝙁𝙄𝘾𝙄𝘼𝙇 𝘾𝙊𝘿𝙀 🛠️
   
   📌 NOTE:
   If you use or copy any part of this code,
   you MUST give proper credit!

   📞 Contact: +241 05730123
   🌐 GitHub: https://github.com/DavidTechInc

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━*/

const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "💫",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `*╭─❖「 𝐓𝐄𝐑𝐑𝐀 𝐗𝐌𝐃 」❖─╮*
*│🔹 Mode : ${config.MODE}*
*│🔹 Prefix : ${config.PREFIX}*
*│🔹 Bot Name : ${config.BOT_NAME}*
*│🔹 Version : 4.2.1*
*╰────────────────────╯*

*╭─❒⁠⁠⁠⁠* *📥 DOWNLOAD-MENU 📥* *❒⁠⁠⁠⁠* 
*├⬡* *.ғʙ*
*├⬡* *.ɪɴꜱᴛᴀ*
*├⬡* *.ᴠɪᴅᴇᴏ*
*├⬡* *.ɢᴅʀɪᴠᴇ*
*├⬡* *.ᴛᴡɪᴛᴛᴇʀ*
*├⬡* *.ᴛᴛ*
*├⬡* *.ᴍᴇᴅɪᴀғɪʀᴇ*
*├⬡* *.ᴘʟᴀʏ*
*├⬡* *.sᴏɴɢ*
*├⬡* *.ᴠɪᴅᴇᴏ*
*├⬡* *.sᴘᴏᴛɪꜰʏ*
*├⬡* *.ᴠɪᴅᴇᴏ4*
*├⬡* *.ɪᴍɢ*
*├⬡* *.Lʏʀɪᴄs*
*├⬡* *.ᴀᴘᴋ*
*├⬡* *.ʙᴀɪsᴄᴏᴘᴇ*
*├⬡* *.ɢɪɴɪsɪsɪʟᴀ*
*┕──────────────❒*
*╭─❒⁠⁠⁠⁠* *🔎 SEARCH-MENU 🔍* *❒⁠⁠⁠⁠* 
*├⬡* *.ʏᴛꜱ*
*├⬡* *.ʏᴛᴀ*
*├⬡* *.ᴍᴏᴠɪᴇɪɴғᴏ*
*├⬡* *.ᴍᴏᴠɪᴇ*
*├⬡* *.Gᴏᴏɢʟᴇ*
*├⬡* *.ᴡᴇᴀᴛʜᴇʀ*
*├⬡* *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *🎮 GAME-MENU 🎮* *❒⁠⁠⁠⁠* 
*├⬡* *.ɴᴜᴍʙᴇʀɢᴀᴍᴇ*
*├⬡* *.ʀᴏʟʟ🎲*
*├⬡* *.ᴄᴏɪɴꜰʟɪᴘ🪙*
*├⬡* *.pick*
*├⬡* *.ᴋᴏɴᴀᴍɪ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *🔞 NSFW-MENU 🔞* *❒⁠⁠⁠⁠* 
*├⬡* *.ɴsғᴡᴍᴇɴᴜ*
*├⬡* *.ᴛᴇʀʀᴀɴᴜᴅᴇ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *🧠 AI-MENU 🧠* *❒⁠⁠⁠⁠* 
*├⬡* *.ɢᴘᴛ*
*├⬡* *.ᴀɪ*
*├⬡* *.ᴀɴᴀʟʏsᴇ*
*├⬡* *.ʟʟᴀᴍᴀ3*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *👨‍💻 OWNER-MENU 👨‍💻* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*├⬡* *.sᴇᴛᴛɪɴɢs*
*├⬡* *.ᴏᴡɴᴇʀ*
*├⬡* *.ʀᴇᴘᴏ*
*├⬡* *.ꜱʏꜱᴛᴇᴍ*
*├⬡* *.ꜱᴛᴀᴛᴜꜱ*
*├⬡* *.Aʙᴏᴜᴛ*
*├⬡* *.ʙʟᴏᴄᴋ*
*├⬡* *.ᴇᴠᴀʟ*
*├⬡* *.ᴜɴʙʟᴏᴄᴋ*
*├⬡* *.sʜᴜᴛᴅᴏᴡɴ*
*├⬡* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
*├⬡* *.sᴇᴛᴘᴘ*
*├⬡* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*├⬡* *.ᴊɪᴅ*
*├⬡* *.ɢᴊɪᴅ*
*├⬡* *.ᴘᴀɪʀ*
*├⬡* *.sᴀᴠᴇ*
*├⬡* *.ᴄᴀʟᴄ*
*├⬡* *.ʀᴇꜱᴛᴀʀᴛ*
*├⬡* *.SetSudo*
*┕───────────────❒*
*╭──❒⁠⁠⁠⁠* *👥 GROUP-MENU 👥* *❒⁠⁠⁠⁠* 
*├⬡* *.ʀᴇᴍᴏᴠᴇ*
*├⬡* *.ᴅᴇʟ*
*├⬡* *.ᴀᴅᴅ*
*├⬡* *.ᴋɪᴄᴋ*
*├⬡* *.ᴋɪᴄᴋᴀʟʟ*
*├⬡* *.sᴇᴛɢᴏᴏᴅʙʏᴇ*
*├⬡* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
*├⬡* *.ᴘʀᴏᴍᴏᴛᴇ*
*├⬡* *.ᴅᴇᴍᴏᴛᴇ*
*├⬡* *.ᴛᴀɢᴀʟʟ*
*├⬡* *.ɢᴇᴛᴘɪᴄ*
*├⬡* *.ɪɴᴠɪᴛᴇ*
*├⬡* *.ʀᴇᴠᴏᴋᴇ*
*├⬡* *.ᴘᴏʟʟ*
*├⬡* *.ʀᴀɴᴅᴏᴍsʜɪᴘ*
*├⬡* *.ɴᴇᴡɢᴄ*
*├⬡* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*├⬡* *.ᴀʟʟʀᴇǫ*
*├⬡* *.ᴍᴜᴛᴇ*
*├⬡* *.ᴜɴᴍᴜᴛᴇ*
*├⬡* *.ʟᴏᴄᴋɢᴄ*
*├⬡* *.ᴜɴʟᴏᴄᴋɢᴄ*
*├⬡* *.ʟᴇᴀᴠᴇ*
*├⬡* *.ɢɴᴀᴍᴇ*
*├⬡* *.ɢᴅᴇsᴄ*
*├⬡* *.ᴊᴏɪɴ*
*├⬡* *.ʜɪᴅᴇᴛᴀɢ*
*├⬡* *.ɢɪɴғᴏ*
*├⬡* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏɴ*
*├⬡* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏғғ*
*├⬡* *.ᴇᴘʜᴇᴍᴇʀᴀʟ 7ᴅ 24ʜ 90ᴅ*
*├⬡* *.sᴇɴᴅᴅᴍ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *📃 INFO-MENU 📃* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴀʙᴏᴜᴛ*
*├⬡* *.Dᴇᴠ*
*├⬡* *.ᴀʟɪᴠᴇ*
*├⬡* *.ʀᴇǫᴜᴇsᴛ*
*├⬡* *.ʙᴏᴛɪɴꜰᴏ*
*├⬡* *.ꜱᴛᴀᴛᴜꜱ*
*├⬡* *.ᴘɪɴɢ*
*├⬡* *.ᴘɪɴɢ2*
*├⬡* *.ꜱʏꜱᴛᴇᴍ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *✝️ RELIGION-MENU ✝️* *❒⁠⁠⁠⁠* 
*├⬡* *.ʙɪʙʟᴇ*
*├⬡* *.ʙɪʙʟᴇʟɪsᴛ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *🤖 BOT-MENU 🤖* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴠᴇʀsɪᴏɴ*
*├⬡* *.ʀᴇᴘᴏ*
*├⬡* *.ᴍᴇɴᴜ*
*├⬡* *.ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ*
*├⬡* *.ᴜᴘᴅᴀᴛᴇ*
*├⬡* *.ᴍᴏᴅᴇ*
*├⬡* *.ᴀᴜᴛᴏᴛʏᴘɪɴɢ*
*├⬡* *.ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴀᴅsᴛᴀᴛᴜs*
*├⬡* *.ᴀɴᴛɪʙᴀᴅ*
*├⬡* *.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴘʟʏ*
*├⬡* *.ᴀᴜᴛᴏʀᴇᴀᴄᴛ*
*├⬡* *.ᴀɴᴛɪʟɪɴᴋ*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *🎡 CONVERTER-MENU 🎡* *❒⁠⁠⁠⁠* 
*├⬡* *.sᴛɪᴄᴋᴇʀ*
*├⬡* *.ᴛᴀᴋᴇ*
*├⬡* *.ᴛʀᴛ*
*├⬡* *.ᴛᴛs*
*├⬡* *.ꜰᴀɴᴄʏ*
*├⬡* *.ᴜʀʟ*
*├⬡* *.sᴇɴᴅɪᴍᴀɢᴇ*
*├⬡* *.Aɢᴇ*
*├⬡* *.Cᴏɴᴠᴇʀᴛ*
*├⬡* *.ᴛɪɴʏ*
*├⬡* *.ᴛɢs*
*┕─────────────❒*
*╭──❒⁠⁠⁠⁠* *🌐 OTHER-MENU 🌐* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴛʀᴛ*
*├⬡* *.ᴊᴏᴋᴇ*
*├⬡* *.ꜰᴀᴄᴛ*
*├⬡* *.ɢɪᴛʜᴜʙ*
*├⬡* *.ɢᴘᴀꜱꜱ*
*├⬡* *.ʜᴀᴄᴋ*
*├⬡* *.ǫᴜᴏᴛᴇ*
*├⬡* *.ǫʀ*
*├⬡* *.vv*
*├⬡* *.sᴘᴀᴍ*
*├⬡* *.ᴠᴄᴀʀᴅ*
*├⬡* *.ꜱʀᴇᴘᴏ*
*├⬡* *.sʏsᴛᴇᴍ*
*├⬡* *.ʀᴀɴᴋ*
*├⬡* *.Tɪᴍᴇᴢᴏɴᴇ*
*├⬡* *.ᴅᴇꜰɪɴᴇ*
*├⬡* *.Dᴀɪʟʏꜰᴀᴄᴛ*
*├⬡* *.Mɪɴᴜᴛᴏʀ*
*┕─────────────❒*
*╭──❒⁠⁠⁠⁠* *🏜️ WALLPAPERS-MENU 🏜️* *❒⁠⁠⁠⁠* 
*├⬡* *.ɪᴍɢ*
*├⬡* *.ʟᴏɢᴏ*
*├⬡* *.ss*
*┕──────────────❒*
*╭──❒⁠⁠⁠⁠* *⛱️ RANDOM-MENU ⛱️* *❒⁠⁠⁠⁠* 
*├⬡* *.ᴅᴏɢ*
*├⬡* *.ᴄᴀᴛ*
*├⬡* *.ᴅɪᴀʀʏ*
*├⬡* *.ᴀɴɪᴍᴇ*
*├⬡* *.ᴄᴏᴜᴘʟᴇᴘᴘ*
*├⬡* *.ꜰɪɴᴅɴᴀᴍᴇ*
*├⬡* *.ʟᴏʟɪ*
*├⬡* *.ᴡᴀɪꜰᴜ*
*├⬡* *.ᴄᴏsᴘʟᴀʏ*
*├⬡* *.ɴᴇᴋᴏ*
*├⬡* *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
*├⬡* *.Sᴇɴᴅɪᴍᴀɢᴇ*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*├⬡* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*├⬡* *.ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
*┕──────────────❒*
> ENJOY BY CRAZY TECH🌟
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu,
                          contextInfo: {
    mentionedJid: [m.sender],
    forwardingScore: 999,
    isForwarded: true,
    forwardedNewsletterMessageInfo: {
      newsletterJid: '120363400129137847@newsletter',
      newsletterName: 'TERRA XMD WHA-BOT',
      serverMessageId: 999
    }
  }
}, { quoted: mek });
}catch(e){
console.log(e)
reply(`${e}`)
}
})
